//
//  ListOfQuestions.swift
//  DatingApp
//
//  Created by Max Khizhniakov on 04.09.2020.
//

import Foundation

struct ListOfQuestions {
    let listOfActions: [String] = [
        "Намажь губы чем-нибудь вкусным и поцелуй меня.",
        "Затащи меня в примерочную на семь минут в раю.",
        "Ласкай меня в двух местах сразу (руками и языком).",
        "Проведи линию языком от моего запястья до уха.",
        "Скажи мне эротичным шепотом, что тебе понравилось в нашем последнем сексе.",
        "Зайди со мной в душ и тщательно потри меня мочалкой.",
        "Возбуди меня поцелуями за 10 секунд.",
        "Поцелуй меня так, как мы целовались на первых свиданиях.",
        "Съешь фрукт максимально эротичным способом.",
        "Спой песню, под которую хочешь заняться сексом.",
        "Повтори мое любимое движение в постели.",
        "Пощекочи меня.",
        "Покажи мне, какую позу хочешь попробовать.",
        "Сделай эротический массаж.",
        "Коснись себя так, как хочешь касаться меня.",
        "Напиши на мне признание в любви или комплимент языком.",
        "Представь, что я незнакомка в баре. Познакомься и убеди меня пойти к тебе.",
        "Я брызну духами на какую-то часть тела в другой комнате. Твоя задача - понять на какую.",
        "Возьми в рот кусочек льда и ласкай меня языком в течение 15 секунд.",
        "Включи вибросигнал в телефоне, положи его мне на живот и позвони.",
        "Посыпь сахаром дорожку от моей груди вниз и пройдись по ней языком.",
        "Сними с меня нижнее белье без помощи рук.",
        "Намочи пальцы слюной и погладь меня по груди.",
        "Выбери часть тела, которая не считается эрогенной зоной (колени, локти…) и целуй, пока не начнет ею считаться.",
        "Осуществи свою сексуальную фантазию прямо сейчас.",
    ]
    let listOfQuestions: [String] = [
        "Спишь ли ты голышом?",
        "Тебя возбуждает стриптиз?",
        "Согласился бы ты провести со мной интимную ночь?",
        "Какая твоя любимая поза в сексе?",
        "У тебя есть эротическое белье или костюмы?",
        "О ком ты мечтаешь в эротических фантазиях?",
        "Изменял ли ты любимому?",
        "У тебя есть фото в стиле «ню»?",
        "Ты умеешь делать эротический массаж?",
        "Есть ли у тебя секреты соблазнения?",
        "Существует ли человек, которого ты реально ненавидишь?",
        "Как бы ты провел день, если бы поменялся телами со своей второй половинкой?",
        "Если бы вы умели превращаться в животное, кем бы вы стали?",
        "С кем бы вы не против застрять в лифте?",
        "Расскажите о своей жизни глазами вашего домашнего животного.",
        "Правда ли, что если другу признаться в любви, дружба исчезнет?",
        "Как ты относишься к сексуальным меньшинствам?",
        "Если бы ты выиграл миллион, на что бы потратил?",
        "Снимал ли ты секс на видео?",
        "Сколько лет тебе было, когда произошел первый половой контакт?",
        "Какая часть тела у противоположного пола для тебя является наиболее эротической?",
        "Как относишься к ролевым играм?",
        "Какой для тебя оптимальный возраст полового партнера?",
        "Опиши свои эротические фантазии.",
        "Что тебе не нравится в сексе?",
        "Твои предпочтения в сексе.",
        "Был ли у тебя неприятный любовный опыт?",
        "Какой типаж противоположного пола в твоем вкусе?",
        "Был ли у вас секс на работе?",
        "Что вас возбуждает в партнере?",
        "Какое время суток наиболее подходяще для секса?",
        "Расскажите о вашей скрытой сексуальной фантазии.",
        "Вы смотрите эротические фильмы?",
        "Секс в отношениях важен, чтобы быть счастливыми?",
        "Фраза, после которой вы готовы прыгнуть на любимого.",
        "Что вы знаете о сексуальных предпочтениях любимого человека?",
        "Хотели бы вы увидеть стриптиз в исполнении второй половинки?",
    ]
}
